SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG28/Include/efr32zg28b322f1024im48.h
/* Instance macros for PCNT */
#define PCNT(n)                         (((n) == 0) ? PCNT0 \
                                         : 0x0UL)
#define PCNT_NUM(ref)                   (((ref) == PCNT0) ? 0 \
                                         : -1)
#define PCNT_PCNT_WIDTH(n)              (((n) == 0) ? PCNT0_PCNT_WIDTH \
                                         : 0x0UL)

/* Instance macros for TIMER */
#define TIMER(n)                        (((n) == 0) ? TIMER0   \
                                         : ((n) == 1) ? TIMER1 \
                                         : ((n) == 2) ? TIMER2 \
                                         : ((n) == 3) ? TIMER3 \
                                         : ((n) == 4) ? TIMER4 \
                                         : 0x0UL)
#define TIMER_NUM(ref)                  (((ref) == TIMER0) ? 0   \
                                         : ((ref) == TIMER1) ? 1 \
                                         : ((ref) == TIMER2) ? 2 \
                                         : ((ref) == TIMER3) ? 3 \
                                         : ((ref) == TIMER4) ? 4 \
                                         : -1)
#define TIMER_CC_NUM(n)                 (((n) == 0) ? TIMER0_CC_NUM   \
                                         : ((n) == 1) ? TIMER1_CC_NUM \
                                         : ((n) == 2) ? TIMER2_CC_NUM \
                                         : ((n) == 3) ? TIMER3_CC_NUM \
                                         : ((n) == 4) ? TIMER4_CC_NUM \
                                         : 0x0UL)
#define TIMER_CNTWIDTH(n)               (((n) == 0) ? TIMER0_CNTWIDTH   \
                                         : ((n) == 1) ? TIMER1_CNTWIDTH \
                                         : ((n) == 2) ? TIMER2_CNTWIDTH \
                                         : ((n) == 3) ? TIMER3_CNTWIDTH \
                                         : ((n) == 4) ? TIMER4_CNTWIDTH \
                                         : 0x0UL)
#define TIMER_DTI(n)                    (((n) == 0) ? TIMER0_DTI   \
                                         : ((n) == 1) ? TIMER1_DTI \
                                         : ((n) == 2) ? TIMER2_DTI \
                                         : ((n) == 3) ? TIMER3_DTI \
                                         : ((n) == 4) ? TIMER4_DTI \
                                         : 0x0UL)
#define TIMER_DTI_CC_NUM(n)             (((n) == 0) ? TIMER0_DTI_CC_NUM   \
                                         : ((n) == 1) ? TIMER1_DTI_CC_NUM \
                                         : ((n) == 2) ? TIMER2_DTI_CC_NUM \
                                         : ((n) == 3) ? TIMER3_DTI_CC_NUM \
                                         : ((n) == 4) ? TIMER4_DTI_CC_NUM \
                                         : 0x0UL)
#define TIMER_NO_DTI(n)                 (((n) == 0) ? TIMER0_NO_DTI   \
                                         : ((n) == 1) ? TIMER1_NO_DTI \
                                         : ((n) == 2) ? TIMER2_NO_DTI \
                                         : ((n) == 3) ? TIMER3_NO_DTI \
                                         : ((n) == 4) ? TIMER4_NO_DTI \
                                         : 0x0UL)

/* Instance macros for USART */
#define USART(n)                        (((n) == 0) ? USART0 \
                                         : 0x0UL)
#define USART_NUM(ref)                  (((ref) == USART0) ? 0 \
                                         : -1)
#define USART_AUTOTX_REG(n)             (((n) == 0) ? USART0_AUTOTX_REG \
                                         : 0x0UL)
#define USART_AUTOTX_REG_B(n)           (((n) == 0) ? USART0_AUTOTX_REG_B \
                                         : 0x0UL)
#define USART_AUTOTX_TRIGGER(n)         (((n) == 0) ? USART0_AUTOTX_TRIGGER \
                                         : 0x0UL)
#define USART_AUTOTX_TRIGGER_B(n)       (((n) == 0) ? USART0_AUTOTX_TRIGGER_B \
                                         : 0x0UL)
#define USART_CLK_PRS(n)                (((n) == 0) ? USART0_CLK_PRS \
                                         : 0x0UL)
#define USART_CLK_PRS_B(n)              (((n) == 0) ? USART0_CLK_PRS_B \
                                         : 0x0UL)
#define USART_FLOW_CONTROL(n)           (((n) == 0) ? USART0_FLOW_CONTROL \
                                         : 0x0UL)
#define USART_FLOW_CONTROL_B(n)         (((n) == 0) ? USART0_FLOW_CONTROL_B \
                                         : 0x0UL)
#define USART_I2S(n)                    (((n) == 0) ? USART0_I2S \
                                         : 0x0UL)
#define USART_I2S_B(n)                  (((n) == 0) ? USART0_I2S_B \
                                         : 0x0UL)
#define USART_IRDA_AVAILABLE(n)         (((n) == 0) ? USART0_IRDA_AVAILABLE \
                                         : 0x0UL)
#define USART_IRDA_AVAILABLE_B(n)       (((n) == 0) ? USART0_IRDA_AVAILABLE_B \
                                         : 0x0UL)
#define USART_MVDIS_FUNC(n)             (((n) == 0) ? USART0_MVDIS_FUNC \
                                         : 0x0UL)
#define USART_MVDIS_FUNC_B(n)           (((n) == 0) ? USART0_MVDIS_FUNC_B \
                                         : 0x0UL)
#define USART_RX_PRS(n)                 (((n) == 0) ? USART0_RX_PRS \
                                         : 0x0UL)
#define USART_RX_PRS_B(n)               (((n) == 0) ? USART0_RX_PRS_B \
                                         : 0x0UL)
#define USART_SC_AVAILABLE(n)           (((n) == 0) ? USART0_SC_AVAILABLE \
                                         : 0x0UL)
#define USART_SC_AVAILABLE_B(n)         (((n) == 0) ? USART0_SC_AVAILABLE_B \
                                         : 0x0UL)
#define USART_SYNC_AVAILABLE(n)         (((n) == 0) ? USART0_SYNC_AVAILABLE \
                                         : 0x0UL)
#define USART_SYNC_AVAILABLE_B(n)       (((n) == 0) ? USART0_SYNC_AVAILABLE_B \
                                         : 0x0UL)
#define USART_SYNC_LATE_SAMPLE(n)       (((n) == 0) ? USART0_SYNC_LATE_SAMPLE \
                                         : 0x0UL)
#define USART_SYNC_LATE_SAMPLE_B(n)     (((n) == 0) ? USART0_SYNC_LATE_SAMPLE_B \
                                         : 0x0UL)
#define USART_TIMER(n)                  (((n) == 0) ? USART0_TIMER \
                                         : 0x0UL)
#define USART_TIMER_B(n)                (((n) == 0) ? USART0_TIMER_B \
                                         : 0x0UL)

/* Instance macros for VDAC */
#define VDAC(n)                         (((n) == 0) ? VDAC0 \
                                         : 0x0UL)
#define VDAC_NUM(ref)                   (((ref) == VDAC0) ? 0 \
                                         : -1)
#define VDAC_ALT_WIDTH(n)               (((n) == 0) ? VDAC0_ALT_WIDTH \
                                         : 0x0UL)
#define VDAC_CH0_TRIG_LESENSE(n)        (((n) == 0) ? VDAC0_CH0_TRIG_LESENSE \
                                         : 0x0UL)
#define VDAC_CH1_TRIG_LESENSE(n)        (((n) == 0) ? VDAC0_CH1_TRIG_LESENSE \
                                         : 0x0UL)
#define VDAC_FIFO_DEPTH(n)              (((n) == 0) ? VDAC0_FIFO_DEPTH \
                                         : 0x0UL)
#define VDAC_INT_PRESC_WIDTH(n)         (((n) == 0) ? VDAC0_INT_PRESC_WIDTH \
                                         : 0x0UL)
#define VDAC_RESOLUTION(n)              (((n) == 0) ? VDAC0_RESOLUTION \
                                         : 0x0UL)

/* Instance macros for WDOG */
#define WDOG(n)                         (((n) == 0) ? WDOG0   \
                                         : ((n) == 1) ? WDOG1 \
                                         : 0x0UL)
#define WDOG_NUM(ref)                   (((ref) == WDOG0) ? 0   \
                                         : ((ref) == WDOG1) ? 1 \
                                         : -1)
#define WDOG_PCNUM(n)                   (((n) == 0) ? WDOG0_PCNUM   \
                                         : ((n) == 1) ? WDOG1_PCNUM \
                                         : 0x0UL)

/** @} End of group EFR32ZG28B322F1024IM48_Peripheral_Parameters  */

/** @} End of group EFR32ZG28B322F1024IM48 */
/** @}} End of group Parts */

#ifdef __cplusplus
}
#endif
#endif
